var data = [
  {
    "reg": {
      "name": "北京",
      "value": "0101"
    },
    "city": [
      {
        "name": "东城",
        "value": "010101"
      },
      {
        "name": "西城",
        "value": "010102"
      },
      {
        "name": "朝阳",
        "value": "010105"
      },
      {
        "name": "海淀",
        "value": "010108"
      },
      {
        "name": "门头沟",
        "value": "010109"
      },
      {
        "name": "通州",
        "value": "010111"
      },
      {
        "name": "顺义",
        "value": "010112"
      },
      {
        "name": "大兴",
        "value": "010114"
      },
      {
        "name": "平谷",
        "value": "010115"
      },
      {
        "name": "密云",
        "value": "010117"
      },
      {
        "name": "宣武",
        "value": "010104"
      },
      {
        "name": "石景山",
        "value": "010107"
      },
      {
        "name": "房山",
        "value": "010110"
      },
      {
        "name": "延庆",
        "value": "010118"
      },
      {
        "name": "丰台",
        "value": "010106"
      },
      {
        "name": "昌平",
        "value": "010113"
      },
      {
        "name": "怀柔",
        "value": "010116"
      },
      {
        "name": "崇文",
        "value": "010103"
      }
    ]
  },
  {
    "reg": {
      "name": "上海",
      "value": "0102"
    },
    "city": [
      {
        "name": "南汇",
        "value": "010217"
      },
      {
        "name": "黄浦",
        "value": "010201"
      },
      {
        "name": "卢湾",
        "value": "010202"
      },
      {
        "name": "虹口",
        "value": "010208"
      },
      {
        "name": "杨浦",
        "value": "010209"
      },
      {
        "name": "浦东",
        "value": "010213"
      },
      {
        "name": "徐汇",
        "value": "010203"
      },
      {
        "name": "长宁",
        "value": "010204"
      },
      {
        "name": "静安",
        "value": "010205"
      },
      {
        "name": "闵行",
        "value": "010210"
      },
      {
        "name": "金山",
        "value": "010214"
      },
      {
        "name": "松江",
        "value": "010215"
      },
      {
        "name": "奉贤",
        "value": "010218"
      },
      {
        "name": "普陀",
        "value": "010206"
      },
      {
        "name": "闸北",
        "value": "010207"
      },
      {
        "name": "宝山",
        "value": "010211"
      },
      {
        "name": "嘉定",
        "value": "010212"
      },
      {
        "name": "崇明",
        "value": "010219"
      },
      {
        "name": "青浦",
        "value": "010216"
      }
    ]
  },
  {
    "reg": {
      "name": "天津",
      "value": "0103"
    },
    "city": [
      {
        "name": "东丽",
        "value": "010302"
      },
      {
        "name": "津南",
        "value": "010306"
      },
      {
        "name": "南开",
        "value": "010307"
      },
      {
        "name": "塘沽",
        "value": "010312"
      },
      {
        "name": "汉沽",
        "value": "010313"
      },
      {
        "name": "大港",
        "value": "010314"
      },
      {
        "name": "宁河",
        "value": "010315"
      },
      {
        "name": "静海",
        "value": "010316"
      },
      {
        "name": "蓟县",
        "value": "010318"
      },
      {
        "name": "和平",
        "value": "010301"
      },
      {
        "name": "河东",
        "value": "010303"
      },
      {
        "name": "河西",
        "value": "010305"
      },
      {
        "name": "河北",
        "value": "010309"
      },
      {
        "name": "红桥",
        "value": "010311"
      },
      {
        "name": "宝坻",
        "value": "010317"
      },
      {
        "name": "西青",
        "value": "010304"
      },
      {
        "name": "北辰",
        "value": "010308"
      },
      {
        "name": "武清",
        "value": "010310"
      }
    ]
  },
  {
    "reg": {
      "name": "重庆",
      "value": "0104"
    },
    "city": [
      {
        "name": "渝中",
        "value": "010403"
      },
      {
        "name": "大渡口",
        "value": "010404"
      },
      {
        "name": "九龙坡",
        "value": "010407"
      },
      {
        "name": "南岸",
        "value": "010408"
      },
      {
        "name": "万盛",
        "value": "010410"
      },
      {
        "name": "巴南",
        "value": "010413"
      },
      {
        "name": "酉阳",
        "value": "010435"
      },
      {
        "name": "彭水",
        "value": "010436"
      },
      {
        "name": "南川",
        "value": "010440"
      },
      {
        "name": "黔江",
        "value": "010414"
      },
      {
        "name": "綦江",
        "value": "010416"
      },
      {
        "name": "潼南",
        "value": "010417"
      },
      {
        "name": "武隆",
        "value": "010426"
      },
      {
        "name": "石柱",
        "value": "010433"
      },
      {
        "name": "秀山",
        "value": "010434"
      },
      {
        "name": "涪陵",
        "value": "010402"
      },
      {
        "name": "江北",
        "value": "010405"
      },
      {
        "name": "沙坪坝",
        "value": "010406"
      },
      {
        "name": "北碚",
        "value": "010409"
      },
      {
        "name": "丰都",
        "value": "010424"
      },
      {
        "name": "合川",
        "value": "010438"
      },
      {
        "name": "双挢",
        "value": "010411"
      },
      {
        "name": "渝北",
        "value": "010412"
      },
      {
        "name": "长寿",
        "value": "010415"
      },
      {
        "name": "铜梁",
        "value": "010418"
      },
      {
        "name": "大足",
        "value": "010419"
      },
      {
        "name": "万州",
        "value": "010401"
      },
      {
        "name": "梁平",
        "value": "010422"
      },
      {
        "name": "城口",
        "value": "010423"
      },
      {
        "name": "垫江",
        "value": "010425"
      },
      {
        "name": "忠县",
        "value": "010427"
      },
      {
        "name": "开县",
        "value": "010428"
      },
      {
        "name": "云阳",
        "value": "010429"
      },
      {
        "name": "奉节",
        "value": "010430"
      },
      {
        "name": "巫山",
        "value": "010431"
      },
      {
        "name": "巫溪",
        "value": "010432"
      },
      {
        "name": "永川",
        "value": "010439"
      },
      {
        "name": "荣昌",
        "value": "010420"
      },
      {
        "name": "壁山",
        "value": "010421"
      },
      {
        "name": "江津",
        "value": "010437"
      }
    ]
  },
  {
    "reg": {
      "name": "河北",
      "value": "0105"
    },
    "city": [
      {
        "name": "唐山",
        "value": "010508"
      },
      {
        "name": "承德",
        "value": "010506"
      },
      {
        "name": "秦皇岛",
        "value": "010509"
      },
      {
        "name": "保定",
        "value": "010504"
      },
      {
        "name": "石家庄",
        "value": "010501"
      },
      {
        "name": "衡水",
        "value": "010511"
      },
      {
        "name": "张家口",
        "value": "010505"
      },
      {
        "name": "邢台",
        "value": "010503"
      },
      {
        "name": "沧州",
        "value": "010510"
      },
      {
        "name": "邯郸",
        "value": "010502"
      },
      {
        "name": "廊坊",
        "value": "010507"
      }
    ]
  },
  {
    "reg": {
      "name": "山西",
      "value": "0106"
    },
    "city": [
      {
        "name": "太原",
        "value": "010601"
      },
      {
        "name": "阳泉",
        "value": "010603"
      },
      {
        "name": "晋城",
        "value": "010605"
      },
      {
        "name": "朔州",
        "value": "010606"
      },
      {
        "name": "吕梁",
        "value": "010607"
      },
      {
        "name": "晋中",
        "value": "010609"
      },
      {
        "name": "长治",
        "value": "010604"
      },
      {
        "name": "临汾",
        "value": "010610"
      },
      {
        "name": "运城",
        "value": "010611"
      },
      {
        "name": "大同",
        "value": "010602"
      },
      {
        "name": "忻州",
        "value": "010608"
      }
    ]
  },
  {
    "reg": {
      "name": "内蒙古",
      "value": "0107"
    },
    "city": [
      {
        "name": "呼和浩特",
        "value": "010701"
      },
      {
        "name": "包头",
        "value": "010702"
      },
      {
        "name": "乌海",
        "value": "010703"
      },
      {
        "name": "阿拉善盟",
        "value": "010706"
      },
      {
        "name": "乌兰察布盟",
        "value": "010709"
      },
      {
        "name": "巴彦淖尔盟",
        "value": "010711"
      },
      {
        "name": "伊克昭盟",
        "value": "010712"
      },
      {
        "name": "东胜",
        "value": "010715"
      },
      {
        "name": "赤峰",
        "value": "010704"
      },
      {
        "name": "呼伦贝尔盟",
        "value": "010705"
      },
      {
        "name": "哲里木盟",
        "value": "010707"
      },
      {
        "name": "兴安盟",
        "value": "010708"
      },
      {
        "name": "锡林郭勒盟",
        "value": "010710"
      },
      {
        "name": "通辽",
        "value": "010714"
      },
      {
        "name": "鄂尔多斯",
        "value": "010713"
      }
    ]
  },
  {
    "reg": {
      "name": "辽宁",
      "value": "0108"
    },
    "city": [
      {
        "name": "大连",
        "value": "010802"
      },
      {
        "name": "丹东",
        "value": "010806"
      },
      {
        "name": "沈阳",
        "value": "010801"
      },
      {
        "name": "鞍山",
        "value": "010803"
      },
      {
        "name": "营口",
        "value": "010808"
      },
      {
        "name": "抚顺",
        "value": "010804"
      },
      {
        "name": "本溪",
        "value": "010805"
      },
      {
        "name": "阜新",
        "value": "010809"
      },
      {
        "name": "辽阳",
        "value": "010810"
      },
      {
        "name": "铁岭",
        "value": "010812"
      },
      {
        "name": "锦州",
        "value": "010807"
      },
      {
        "name": "盘锦",
        "value": "010811"
      },
      {
        "name": "葫芦岛",
        "value": "010814"
      }
    ]
  },
  {
    "reg": {
      "name": "吉林",
      "value": "0109"
    },
    "city": [
      {
        "name": "长春",
        "value": "010901"
      },
      {
        "name": "吉林",
        "value": "010902"
      },
      {
        "name": "四平",
        "value": "010903"
      },
      {
        "name": "辽源",
        "value": "010904"
      },
      {
        "name": "通化",
        "value": "010905"
      },
      {
        "name": "白山",
        "value": "010906"
      },
      {
        "name": "松原",
        "value": "010907"
      },
      {
        "name": "白城",
        "value": "010908"
      },
      {
        "name": "延边",
        "value": "010909"
      }
    ]
  },
  {
    "reg": {
      "name": "黑龙江",
      "value": "0110"
    },
    "city": [
      {
        "name": "哈尔滨",
        "value": "011001"
      },
      {
        "name": "齐齐哈尔",
        "value": "011002"
      },
      {
        "name": "牡丹江",
        "value": "011003"
      },
      {
        "name": "佳木斯",
        "value": "011004"
      },
      {
        "name": "大庆",
        "value": "011005"
      },
      {
        "name": "绥化",
        "value": "011006"
      },
      {
        "name": "大兴安岭",
        "value": "011013"
      },
      {
        "name": "鹤岗",
        "value": "011007"
      },
      {
        "name": "鸡西",
        "value": "011008"
      },
      {
        "name": "黑河",
        "value": "011009"
      },
      {
        "name": "双鸭山",
        "value": "011010"
      },
      {
        "name": "伊春",
        "value": "011011"
      },
      {
        "name": "七台河",
        "value": "011012"
      }
    ]
  },
  {
    "reg": {
      "name": "江苏",
      "value": "0111"
    },
    "city": [
      {
        "name": "苏州",
        "value": "011103"
      },
      {
        "name": "常熟",
        "value": "011114"
      },
      {
        "name": "张家港",
        "value": "011116"
      },
      {
        "name": "太仓",
        "value": "011117"
      },
      {
        "name": "无锡",
        "value": "011110"
      },
      {
        "name": "南京",
        "value": "011101"
      },
      {
        "name": "淮安",
        "value": "011113"
      },
      {
        "name": "江阴",
        "value": "011121"
      },
      {
        "name": "南通",
        "value": "011104"
      },
      {
        "name": "盐城",
        "value": "011106"
      },
      {
        "name": "昆山",
        "value": "011115"
      },
      {
        "name": "常州",
        "value": "011109"
      },
      {
        "name": "镇江",
        "value": "011102"
      },
      {
        "name": "泰州",
        "value": "011112"
      },
      {
        "name": "泰兴",
        "value": "011118"
      },
      {
        "name": "靖江",
        "value": "011119"
      },
      {
        "name": "兴化",
        "value": "011120"
      },
      {
        "name": "徐州",
        "value": "011107"
      },
      {
        "name": "宿迁",
        "value": "011111"
      },
      {
        "name": "扬州",
        "value": "011105"
      },
      {
        "name": "连云港",
        "value": "011108"
      }
    ]
  },
  {
    "reg": {
      "name": "浙江",
      "value": "0112"
    },
    "city": [
      {
        "name": "杭州",
        "value": "011201"
      },
      {
        "name": "台州",
        "value": "011210"
      },
      {
        "name": "临海",
        "value": "011216"
      },
      {
        "name": "宁波",
        "value": "011202"
      },
      {
        "name": "舟山",
        "value": "011209"
      },
      {
        "name": "余慈",
        "value": "011212"
      },
      {
        "name": "慈溪",
        "value": "011214"
      },
      {
        "name": "金华",
        "value": "011207"
      },
      {
        "name": "丽水",
        "value": "011211"
      },
      {
        "name": "永康",
        "value": "011218"
      },
      {
        "name": "绍兴",
        "value": "011206"
      },
      {
        "name": "上虞",
        "value": "011220"
      },
      {
        "name": "湖州",
        "value": "011205"
      },
      {
        "name": "衢州",
        "value": "011208"
      },
      {
        "name": "嘉兴",
        "value": "011204"
      },
      {
        "name": "温州",
        "value": "011203"
      },
      {
        "name": "乐清",
        "value": "011213"
      },
      {
        "name": "余姚",
        "value": "011217"
      },
      {
        "name": "义乌",
        "value": "011219"
      },
      {
        "name": "瑞安",
        "value": "011215"
      }
    ]
  },
  {
    "reg": {
      "name": "安徽",
      "value": "0113"
    },
    "city": [
      {
        "name": "合肥",
        "value": "011301"
      },
      {
        "name": "蚌埠",
        "value": "011303"
      },
      {
        "name": "池州",
        "value": "011311"
      },
      {
        "name": "淮南",
        "value": "011312"
      },
      {
        "name": "巢湖",
        "value": "011313"
      },
      {
        "name": "淮北",
        "value": "011305"
      },
      {
        "name": "宿州",
        "value": "011310"
      },
      {
        "name": "阜阳",
        "value": "011314"
      },
      {
        "name": "亳州",
        "value": "011317"
      },
      {
        "name": "铜陵",
        "value": "011306"
      },
      {
        "name": "滁州",
        "value": "011309"
      },
      {
        "name": "六安",
        "value": "011315"
      },
      {
        "name": "芜湖",
        "value": "011302"
      },
      {
        "name": "马鞍山",
        "value": "011304"
      },
      {
        "name": "安庆",
        "value": "011307"
      }
    ]
  },
  {
    "reg": {
      "name": "福建",
      "value": "0114"
    },
    "city": [
      {
        "name": "厦门",
        "value": "011402"
      },
      {
        "name": "龙岩",
        "value": "011408"
      },
      {
        "name": "福州",
        "value": "011401"
      },
      {
        "name": "南平",
        "value": "011407"
      },
      {
        "name": "泉州",
        "value": "011405"
      },
      {
        "name": "三明",
        "value": "011404"
      },
      {
        "name": "漳州",
        "value": "011406"
      },
      {
        "name": "宁德",
        "value": "011409"
      },
      {
        "name": "莆田",
        "value": "011403"
      }
    ]
  },
  {
    "reg": {
      "name": "江西",
      "value": "0115"
    },
    "city": [
      {
        "name": "景德镇",
        "value": "011502"
      },
      {
        "name": "鹰潭",
        "value": "011504"
      },
      {
        "name": "上饶",
        "value": "011511"
      },
      {
        "name": "吉安",
        "value": "011508"
      },
      {
        "name": "抚州",
        "value": "011510"
      },
      {
        "name": "宜春",
        "value": "011509"
      },
      {
        "name": "南昌",
        "value": "011501"
      },
      {
        "name": "九江",
        "value": "011503"
      },
      {
        "name": "萍乡",
        "value": "011505"
      },
      {
        "name": "新余",
        "value": "011506"
      },
      {
        "name": "赣州",
        "value": "011507"
      }
    ]
  },
  {
    "reg": {
      "name": "山东",
      "value": "0116"
    },
    "city": [
      {
        "name": "济南",
        "value": "011601"
      },
      {
        "name": "泰安",
        "value": "011609"
      },
      {
        "name": "莱芜",
        "value": "011612"
      },
      {
        "name": "德州",
        "value": "011614"
      },
      {
        "name": "聊城",
        "value": "011615"
      },
      {
        "name": "青岛",
        "value": "011602"
      },
      {
        "name": "日照",
        "value": "011611"
      },
      {
        "name": "淄博",
        "value": "011603"
      },
      {
        "name": "滨州",
        "value": "011616"
      },
      {
        "name": "烟台",
        "value": "011606"
      },
      {
        "name": "东营",
        "value": "011605"
      },
      {
        "name": "潍坊",
        "value": "011607"
      },
      {
        "name": "枣庄",
        "value": "011604"
      },
      {
        "name": "济宁",
        "value": "011608"
      },
      {
        "name": "菏泽",
        "value": "011617"
      },
      {
        "name": "临沂",
        "value": "011613"
      },
      {
        "name": "威海",
        "value": "011610"
      }
    ]
  },
  {
    "reg": {
      "name": "河南",
      "value": "0117"
    },
    "city": [
      {
        "name": "郑州",
        "value": "011701"
      },
      {
        "name": "新乡",
        "value": "011707"
      },
      {
        "name": "焦作",
        "value": "011708"
      },
      {
        "name": "漯河",
        "value": "011711"
      },
      {
        "name": "济源",
        "value": "011718"
      },
      {
        "name": "洛阳",
        "value": "011703"
      },
      {
        "name": "三门峡",
        "value": "011712"
      },
      {
        "name": "安阳",
        "value": "011705"
      },
      {
        "name": "南阳",
        "value": "011713"
      },
      {
        "name": "开封",
        "value": "011702"
      },
      {
        "name": "周口",
        "value": "011716"
      },
      {
        "name": "驻马店",
        "value": "011717"
      },
      {
        "name": "信阳",
        "value": "011715"
      },
      {
        "name": "商丘",
        "value": "011714"
      },
      {
        "name": "许昌",
        "value": "011710"
      },
      {
        "name": "濮阳",
        "value": "011709"
      },
      {
        "name": "鹤壁",
        "value": "011706"
      },
      {
        "name": "平顶山",
        "value": "011704"
      }
    ]
  },
  {
    "reg": {
      "name": "湖北",
      "value": "0118"
    },
    "city": [
      {
        "name": "武汉",
        "value": "011801"
      },
      {
        "name": "鄂州",
        "value": "011816"
      },
      {
        "name": "襄阳",
        "value": "011804"
      },
      {
        "name": "荆门",
        "value": "011806"
      },
      {
        "name": "孝感",
        "value": "011815"
      },
      {
        "name": "宜昌",
        "value": "011802"
      },
      {
        "name": "恩施",
        "value": "011809"
      },
      {
        "name": "十堰",
        "value": "011808"
      },
      {
        "name": "黄石",
        "value": "011805"
      },
      {
        "name": "荆州",
        "value": "011803"
      },
      {
        "name": "随州",
        "value": "011813"
      },
      {
        "name": "潜江",
        "value": "011810"
      },
      {
        "name": "天门",
        "value": "011811"
      },
      {
        "name": "仙桃",
        "value": "011812"
      },
      {
        "name": "黄冈",
        "value": "011807"
      },
      {
        "name": "咸宁",
        "value": "011814"
      }
    ]
  },
  {
    "reg": {
      "name": "湖南",
      "value": "0119"
    },
    "city": [
      {
        "name": "湘潭",
        "value": "011904"
      },
      {
        "name": "株洲",
        "value": "011903"
      },
      {
        "name": "衡阳",
        "value": "011905"
      },
      {
        "name": "娄底",
        "value": "011909"
      },
      {
        "name": "长沙",
        "value": "011901"
      },
      {
        "name": "永州",
        "value": "011912"
      },
      {
        "name": "邵阳",
        "value": "011907"
      },
      {
        "name": "常德",
        "value": "011902"
      },
      {
        "name": "益阳",
        "value": "011908"
      },
      {
        "name": "岳阳",
        "value": "011906"
      },
      {
        "name": "怀化",
        "value": "011910"
      },
      {
        "name": "湘西",
        "value": "011913"
      },
      {
        "name": "郴州",
        "value": "011911"
      },
      {
        "name": "张家界",
        "value": "011914"
      }
    ]
  },
  {
    "reg": {
      "name": "广东",
      "value": "0120"
    },
    "city": [
      {
        "name": "广州",
        "value": "012001"
      },
      {
        "name": "韶关",
        "value": "012008"
      },
      {
        "name": "清远",
        "value": "012018"
      },
      {
        "name": "深圳",
        "value": "012002"
      },
      {
        "name": "珠海",
        "value": "012003"
      },
      {
        "name": "东莞",
        "value": "012005"
      },
      {
        "name": "中山",
        "value": "012006"
      },
      {
        "name": "河源",
        "value": "012016"
      },
      {
        "name": "揭阳",
        "value": "012020"
      },
      {
        "name": "惠州",
        "value": "012013"
      },
      {
        "name": "汕头",
        "value": "012004"
      },
      {
        "name": "梅州",
        "value": "012014"
      },
      {
        "name": "汕尾",
        "value": "012015"
      },
      {
        "name": "潮州",
        "value": "012019"
      },
      {
        "name": "佛山",
        "value": "012007"
      },
      {
        "name": "云浮",
        "value": "012021"
      },
      {
        "name": "茂名",
        "value": "012011"
      },
      {
        "name": "湛江",
        "value": "012010"
      },
      {
        "name": "肇庆",
        "value": "012012"
      },
      {
        "name": "阳江",
        "value": "012017"
      },
      {
        "name": "江门",
        "value": "012009"
      }
    ]
  },
  {
    "reg": {
      "name": "广西",
      "value": "0121"
    },
    "city": [
      {
        "name": "南宁",
        "value": "012101"
      },
      {
        "name": "梧州",
        "value": "012104"
      },
      {
        "name": "北海",
        "value": "012105"
      },
      {
        "name": "防城港",
        "value": "012106"
      },
      {
        "name": "钦州",
        "value": "012107"
      },
      {
        "name": "贵港",
        "value": "012108"
      },
      {
        "name": "玉林",
        "value": "012109"
      },
      {
        "name": "贺州",
        "value": "012110"
      },
      {
        "name": "百色",
        "value": "012111"
      },
      {
        "name": "河池",
        "value": "012112"
      },
      {
        "name": "来宾",
        "value": "012113"
      },
      {
        "name": "崇左",
        "value": "012114"
      },
      {
        "name": "柳州",
        "value": "012102"
      },
      {
        "name": "桂林",
        "value": "012103"
      }
    ]
  },
  {
    "reg": {
      "name": "海南",
      "value": "0122"
    },
    "city": [
      {
        "name": "海口",
        "value": "012201"
      },
      {
        "name": "琼北",
        "value": "012203"
      },
      {
        "name": "琼南",
        "value": "012204"
      },
      {
        "name": "昌江",
        "value": "012205"
      },
      {
        "name": "东方",
        "value": "012206"
      },
      {
        "name": "儋州",
        "value": "012207"
      },
      {
        "name": "定安",
        "value": "012208"
      },
      {
        "name": "陵水",
        "value": "012209"
      },
      {
        "name": "文昌",
        "value": "012210"
      },
      {
        "name": "白沙",
        "value": "012211"
      },
      {
        "name": "三亚",
        "value": "012202"
      }
    ]
  },
  {
    "reg": {
      "name": "四川",
      "value": "0123"
    },
    "city": [
      {
        "name": "成都",
        "value": "012301"
      },
      {
        "name": "内江",
        "value": "012307"
      },
      {
        "name": "广安",
        "value": "012311"
      },
      {
        "name": "阿坝",
        "value": "012321"
      },
      {
        "name": "南充",
        "value": "012309"
      },
      {
        "name": "达川",
        "value": "012312"
      },
      {
        "name": "遂宁",
        "value": "012318"
      },
      {
        "name": "巴中",
        "value": "012320"
      },
      {
        "name": "绵阳",
        "value": "012302"
      },
      {
        "name": "德阳",
        "value": "012303"
      },
      {
        "name": "广元",
        "value": "012306"
      },
      {
        "name": "乐山",
        "value": "012308"
      },
      {
        "name": "雅安",
        "value": "012313"
      },
      {
        "name": "眉山",
        "value": "012314"
      },
      {
        "name": "宜宾",
        "value": "012310"
      },
      {
        "name": "泸州",
        "value": "012317"
      },
      {
        "name": "自贡",
        "value": "012304"
      },
      {
        "name": "攀枝花",
        "value": "012305"
      },
      {
        "name": "甘孜",
        "value": "012315"
      },
      {
        "name": "凉山",
        "value": "012316"
      },
      {
        "name": "资阳",
        "value": "012319"
      }
    ]
  },
  {
    "reg": {
      "name": "贵州",
      "value": "0124"
    },
    "city": [
      {
        "name": "贵阳",
        "value": "012401"
      },
      {
        "name": "六盘水",
        "value": "012402"
      },
      {
        "name": "遵义",
        "value": "012403"
      },
      {
        "name": "安顺",
        "value": "012404"
      },
      {
        "name": "铜仁",
        "value": "012405"
      },
      {
        "name": "黔西南",
        "value": "012406"
      },
      {
        "name": "毕节",
        "value": "012407"
      },
      {
        "name": "黔东南",
        "value": "012408"
      },
      {
        "name": "黔南",
        "value": "012409"
      }
    ]
  },
  {
    "reg": {
      "name": "云南",
      "value": "0125"
    },
    "city": [
      {
        "name": "昆明",
        "value": "012501"
      },
      {
        "name": "曲靖",
        "value": "012503"
      },
      {
        "name": "昭通",
        "value": "012505"
      },
      {
        "name": "思茅",
        "value": "012509"
      },
      {
        "name": "普洱",
        "value": "012517"
      },
      {
        "name": "丽江",
        "value": "012513"
      },
      {
        "name": "怒江",
        "value": "012514"
      },
      {
        "name": "迪庆",
        "value": "012515"
      },
      {
        "name": "临沧",
        "value": "012516"
      },
      {
        "name": "保山",
        "value": "012511"
      },
      {
        "name": "德宏",
        "value": "012512"
      },
      {
        "name": "玉溪",
        "value": "012504"
      },
      {
        "name": "文山",
        "value": "012508"
      },
      {
        "name": "西双版纳",
        "value": "012510"
      },
      {
        "name": "大理",
        "value": "012502"
      },
      {
        "name": "楚雄",
        "value": "012506"
      },
      {
        "name": "红河",
        "value": "012507"
      }
    ]
  },
  {
    "reg": {
      "name": "西藏",
      "value": "0126"
    },
    "city": [
      {
        "name": "拉萨",
        "value": "012601"
      },
      {
        "name": "日喀则",
        "value": "012602"
      },
      {
        "name": "山南",
        "value": "012603"
      },
      {
        "name": "林芝",
        "value": "012604"
      },
      {
        "name": "昌都",
        "value": "012605"
      },
      {
        "name": "阿里",
        "value": "012606"
      },
      {
        "name": "那曲",
        "value": "012607"
      }
    ]
  },
  {
    "reg": {
      "name": "陕西",
      "value": "0127"
    },
    "city": [
      {
        "name": "西安",
        "value": "012701"
      },
      {
        "name": "宝鸡",
        "value": "012702"
      },
      {
        "name": "铜川",
        "value": "012704"
      },
      {
        "name": "延安",
        "value": "012706"
      },
      {
        "name": "榆林",
        "value": "012707"
      },
      {
        "name": "安康",
        "value": "012709"
      },
      {
        "name": "咸阳",
        "value": "012703"
      },
      {
        "name": "渭南",
        "value": "012705"
      },
      {
        "name": "汉中",
        "value": "012708"
      },
      {
        "name": "商洛",
        "value": "012710"
      }
    ]
  },
  {
    "reg": {
      "name": "甘肃",
      "value": "0128"
    },
    "city": [
      {
        "name": "嘉峪关",
        "value": "012802"
      },
      {
        "name": "兰州",
        "value": "012801"
      },
      {
        "name": "定西",
        "value": "012809"
      },
      {
        "name": "陇南",
        "value": "012810"
      },
      {
        "name": "平凉",
        "value": "012811"
      },
      {
        "name": "庆阳",
        "value": "012812"
      },
      {
        "name": "临夏",
        "value": "012813"
      },
      {
        "name": "甘南",
        "value": "012814"
      },
      {
        "name": "金昌",
        "value": "012803"
      },
      {
        "name": "白银",
        "value": "012804"
      },
      {
        "name": "天水",
        "value": "012805"
      },
      {
        "name": "酒泉",
        "value": "012806"
      },
      {
        "name": "张掖",
        "value": "012807"
      },
      {
        "name": "武威",
        "value": "012808"
      }
    ]
  },
  {
    "reg": {
      "name": "宁夏",
      "value": "0129"
    },
    "city": [
      {
        "name": "银川",
        "value": "012901"
      },
      {
        "name": "石嘴山",
        "value": "012902"
      },
      {
        "name": "吴忠",
        "value": "012903"
      },
      {
        "name": "固原",
        "value": "012904"
      },
      {
        "name": "中卫",
        "value": "012905"
      }
    ]
  },
  {
    "reg": {
      "name": "青海",
      "value": "0130"
    },
    "city": [
      {
        "name": "西宁",
        "value": "013001"
      },
      {
        "name": "海东",
        "value": "013002"
      },
      {
        "name": "海南",
        "value": "013003"
      },
      {
        "name": "海北",
        "value": "013004"
      },
      {
        "name": "黄南",
        "value": "013005"
      },
      {
        "name": "玉树",
        "value": "013006"
      },
      {
        "name": "果洛",
        "value": "013007"
      },
      {
        "name": "海西",
        "value": "013008"
      }
    ]
  },
  {
    "reg": {
      "name": "新疆",
      "value": "0131"
    },
    "city": [
      {
        "name": "乌鲁木齐",
        "value": "013101"
      },
      {
        "name": "石河子",
        "value": "013102"
      },
      {
        "name": "克拉玛依",
        "value": "013103"
      },
      {
        "name": "伊犁",
        "value": "013104"
      },
      {
        "name": "博尔塔拉",
        "value": "013108"
      },
      {
        "name": "吐鲁番",
        "value": "013109"
      },
      {
        "name": "哈密",
        "value": "013110"
      },
      {
        "name": "阿克苏",
        "value": "013113"
      },
      {
        "name": "塔城",
        "value": "013114"
      },
      {
        "name": "阿勒泰",
        "value": "013115"
      },
      {
        "name": "米泉",
        "value": "013117"
      },
      {
        "name": "五家渠",
        "value": "013118"
      },
      {
        "name": "巴音郭勒",
        "value": "013105"
      },
      {
        "name": "昌吉",
        "value": "013106"
      },
      {
        "name": "克孜勒苏柯尔克孜",
        "value": "013107"
      },
      {
        "name": "喀什",
        "value": "013111"
      },
      {
        "name": "和田",
        "value": "013112"
      },
      {
        "name": "阿拉尔",
        "value": "013116"
      }
    ]
  }
]